{
  "block.extshape.petrified_oak_planks": "Petrified Oak Planks",
  "block.extshape.smooth_stone_slab_double": "Double Smooth Stone Slab",

  "block.extshape.?_stairs": "%s Stairs",
  "block.extshape.?_slab": "%s Slab",
  "block.extshape.?_fence": "%s Fence",
  "block.extshape.?_fence_gate": "%s Fence Gate",
  "block.extshape.?_wall": "%s Wall",
  "block.extshape.?_button": "%s Button",
  "block.extshape.?_pressure_plate": "%s Pressure Plate",
  "block.extshape.?_vertical_slab": "Vertical %s Slab",
  "block.extshape.?_quarter_piece": "%s Quarter Piece",
  "block.extshape.?_vertical_stairs": "Vertical %s Stairs",
  "block.extshape.?_vertical_quarter_piece": "Vertical %s Quarter Piece",

  "itemGroup.extshape.wooden_blocks": "§9Extended Block Shape:§r Wooden Blocks",
  "itemGroup.extshape.colorful_blocks": "§9Extended Block Shape:§r Colorful Blocks",
  "itemGroup.extshape.stone_blocks": "§9Extended Block Shape:§r Stone Blocks",
  "itemGroup.extshape.other_blocks": "§9Extended Block Shape:§r Other Blocks",

  "modmenu.descriptionTranslation.extshape": "This mod adds more shapes for many vanilla blocks, including shapes that do not exist in vanilla Minecraft, like vertical slabs, vertical stairs or quarter pieces. Most of the blocks have vanilla behaviours, like what their base block behaves. For example, bedrock stairs and slabs are explosion-immune and wither-immune like bedrock, and wool fences and fence gates are flammable and can be sheared.\nWith this mod you can make more fascinating buildings, and your survival can be also more interesting.",
  "modmenu.summaryTranslation.extshape": "More shapes for many vanilla blocks, which behave like in vanilla.",

  "options.extshape.title": "Configuration of Extended Block Shapes Mod",
  "options.extshape.addToVanillaGroups": "Add to vanilla groups",
  "options.extshape.addToVanillaGroups.tooltip": "If enabled, blocks of this mod will directly display in Minecraft's vanilla item groups, such as %s, %s and %s. The blocks are appended after their base blocks so you can quickly find blocks of a same base block in different shapes. By default, all shapes will be added in the vanilla item group. You may specify which shapes to be added in vanilla groups in the text box below.",
  "options.extshape.showSpecificGroups": "Show specific groups",
  "options.extshape.showSpecificGroups.tooltip": "Add four specific item groups to display blocks that have different shapes (including vanilla and mod) in a fancy order. They are sorted by their base blocks, and blocks based on a same block are displayed together.",
  "options.extshape.shapesToAddToVanilla": "Shapes to add to vanilla",
  "options.extshape.shapesToAddToVanilla.description": "Add which shapes to vanilla item groups? (Separated with space.)",
  "options.extshape.shapesInSpecificGroups": "Shapes in specific group",
  "options.extshape.shapesInSpecificGroups.description": "Add which shapes to the mod's specific item groups? (Separated with space.)",
  "options.extshape.reset": "Reset",
  "options.extshape.preventWoodenWallRecipes": "Prevent wooden wall recipes",
  "options.extshape.preventWoodenWallRecipes.tooltip": "Prevent the crafting recipes of wooden walls, in order to avoid the conflict with wooden trapdoors. When ON, you cannot craft wooden walls. If you installed mods that solve recipe conflict, you can turn this option OFF.",
  "options.extshape.avoidSomeButtonRecipes": "Avoid some button recipes",
  "options.extshape.avoidSomeButtonRecipes.tooltip": "Avoid the crafting recipes of some buttons, in order to avoid the conflict with other items. For instance, the recipe of diamond button from a diamond block conflicts with breaking a diamond block down to 9 diamond items. When ON, you cannot craft those buttons, so that the crafting of other items are ensured. If you installed mods that solve recipe conflict, you can turn this option OFF.",
  "options.extshape.specialSnowSlabCrafting": "Special snow slab crafting",
  "options.extshape.specialSnowSlabCrafting.tooltip": "When ON, snow slab is crafted from a snow layer block, instead of three snow blocks. This is intended to avoid the conflict with the recipe of snow layer. If you have installed mods that solve recipe conflict, you can turn this option OFF.",

  "options.extshape.default": "Default: %s",
  "options.extshape.confirm": "Are you sure?",
  "options.extshape.confirm.noGroups": "Your both '%s' and '%s' are set '%s', which means in Creative Mode you may not directly obtain items in this mod in your Creative inventory. Are you sure to continue?",
  "options.extshape.confirm.redo": "I reconsider",
  "options.extshape.registerBlockFamilies": "Register BlockFamilies",
  "options.extshape.registerBlockFamilies.description": "Usually not recommended to open. If enabled, when initializing Minecraft, the relations of the block in this mod to Minecraft's vanilla blocks will be registered in BlockFamilies. The BlockFamilies registry may be identified by some mods, but may cause potential instability. You usually do not need to enable it.",
  "options.extshape.requires_restart": "Takes effect after restarting game.",

  "options.extshape.reasonable-sorting": "Reasonable Sorting mod config",
  "options.extshape.reasonable-sorting.description": "If you installed Reasonable Sorting mod, you can define how block items are sorted according to their shape, including shapes provided this mod. It may not affect blocks provided by other mods.\n\nYou can also access the mod config screen of Reasonable Sorting by selecting the mod in the mod menu.\n\nIf there is no response on clicking this button, it's likely that you have not installed Reasonable Sorting mod or the version is too low.",
  "options.extshape.dataChanged": "Server data changed. Regenerated server data?",
  "options.extshape.dataChanged.details": "The mod uses runtime resource pack, which is generated on the initialization of Minecraft. You have modified options related to data generation, which may take affect by regenerating server data of this mod. You should also type §7/reload§r command if the server (including the integrated server of single-player mode) is currently running.",
  "options.dataChanged.finish": "The server data of runtime resource pack is re-generated. If you're in single player mode or you're the server owner, please execute %s to apply recipe change. Note that in multiplayer mode only the configuration of server host is valid.",

  "message.extshape.recipe_conflict.start": "Starting recipe conflict check, which may take a while.",
  "message.extshape.recipe_conflict.detected": "Recipe conflict detected: %s",
  "message.extshape.recipe_conflict.unknown": "Unknown situation of recipe detected: %s",
  "message.extshape.recipe_conflict.exception": "Exceptions were found when detecting recipe conflict",
  "message.extshape.recipe_conflict.finish.none": "Finished checking. In total no recipe conflicts have been found.",
  "message.extshape.recipe_conflict.finish.single": "Finished checking. In total %s recipe conflict has been found.",
  "message.extshape.recipe_conflict.finish.plural": "Finished checking. In total %s recipe conflicts have been found.",

  "modmenu.nameTranslation.extshape": "Extended Block Shapes",

  "options.extshape.addToVanillaGroups.blockus": "Please note: to find the extended shapes of blocks in Blockus mod in the creative inventory, you have to enable \"Add To Vanilla Groups\". The blocks only display in item groups of Blockus. There are no specific groups for extended shapes of blocks in Blockus mod."
}